#include <stdio.h>

int main()
{
    /*
     * 1.指针变量数据类型的作用?
     * 1.1指针变量在32位操作系统占用4个字节, 在64位操作系统占用8个字节
     * 指针变量占用的内存大小和指针变量的数据类型无关
     * 1.2指针变量的数据类型是专门用于告诉操作系统, 在访问指向存储空间的时候, 需要取出多少个字节的数据
     *
     * 2.指针的加法和减法运算
     * p + n
     * p - n
     * 指针变量加1,是加上指针变量数据类型的大小
     * 指针变量减1,是减去指针变量数据类型的大小
     */
//    int num = 5;
//    int *p;
//    p = &num;
//    printf("*p = %i\n", *p);

    int ages[] = {1, 3, 5};
    int *p;
    /*
    p = ages;
    printf("*p = %i\n", *p);
    // 指针变量加1,是加上指针变量数据类型的大小
    printf("*p = %i\n", *(p + 1));
    printf("*p = %i\n", *(p + 2));
    */
    p = &ages[1];
    printf("*p = %i\n", *(p - 1));
    return 0;
}
