#include <stdio.h>

int main()
{
    /*
     * 1.二维数组的初始化
     * 1,1定义的同时初始化
     * 1,2先定义再初始化
     */
    // 1.定义的同时初始化
    // 1.1定义的同时完全初始化
//    int nums[2][3] = {
//        {1, 3, 5},
//        {2, 4, 6}
//    };
    // 1.2定义的同时部分初始化
//    int nums[2][3] = {
//        {1, 3, 5}
//    };
//    int nums[2][3] = {
//        {1, 3},
//        {2, 4, 6}
//    };
    // 1.3定义的同时初始化的注意点
    // 如果在定义的同时初始化, 那么一维数组的个数可以省略
//    int nums[][3] = {
//        {1, 3, 5},
//        {2, 4, 6}
//    };
    // 如果在定义的同时初始化, 那么一维数组元素的个数不能省略
//    int nums[2][] = {
//        {1, 3, 5},
//        {2, 4, 6}
//    };
    // 如果在定义的同时初始化, 那么一维数组的{}可以省略
//    int nums[2][3] = {1, 3, 5, 2, 4, 6};

    // 2.先定义再初始化
    int ages[2][3];
    ages[0][0] = 18;
    ages[0][1] = 23;
    ages[0][2] = 31;

    ages[1][0] = 12;
    ages[1][1] = 33;
    ages[1][2] = 44;
    return 0;
}
