#include <stdio.h>

int main()
{
    /*
     * 逻辑运算符
     * 1.逻辑与 &&
     * 格式: 条件表达式A && 条件表达式B
     * 2.逻辑或 ||
     * 格式: 条件表达式A || 条件表达式B
     * 3.逻辑非 !
     * 格式: !条件表达式
     *
     * 逻辑运算符的返回值:
     * 返回值和关系运算符一样, 要么是1要么是0, 如果关系成立就是1, 如果关系不成立就是0
     */
    // 1.逻辑与 &&
    /*
    // 特点: 一假则假
    // 只有有一个表达式的结果是假, 那么整个逻辑与表达式的结果就是假
    //            1(真) && 1(真)
//    int res = (10 > 9) && (5 > 3);
    //           0(假) && 1(真)
//    int res = (10 > 11) && (5 > 3);
    //            1(真) && 0(假)
//    int res = (10 > 9) && (5 > 8);
    //            0(假) && 0(假)
//    int res = (10 > 11) && (5 > 8);
//    printf("res = %i\n", res);

    // 利用逻辑与运算符来判断区间
    int x = 5;
    //           1(真) && 1(真)
    //int res = 10 > 5 && 5 > 3;
    int res = 10 > x && x > 3;
    printf("res = %i\n", res);
    */

    // 2.逻辑或 ||
    /*
    // 特点: 一真则真
    //           1(真) || 1(真)
//    int res = (10 > 9) || (5 > 3);
    //           0(假) || 1(真)
//    int res = (10 > 11) || (5 > 3);
    //           1(真) || 0(假)
//    int res = (10 > 9) || (5 > 8);
    //           0(假) || 0(假)
    int res = (10 > 11) || (5 > 8);
     printf("res = %i\n", res);
     */

    // 3.逻辑非 !
    // 特点: 真变假, 假变真
    // 注意点: C语言中非0既真, 所以对数字也有效
    //        !1(真)
//    int res = !(10 > 5);
    //        !0(假)
//    int res = !(10 > 11);
//    int res = !1;
//    int res = !666;
    int res = !666;
    printf("res = %i\n", res);

    return 0;
}
