#include <stdio.h>

int main()
{
    /*
     * 1.数组的存储细节
     * 1.1和变量一样, 会从内存地址大的开始分配存储空间
     * 1.2和变量一样, 数组的地址就是数组占用内存空间最小的地址
     * 1.3和变量不一样, 给数组每一个元素分配存储空间, 是从数组占用存储空间最小的地址开始分配
     * 1.4和变量一样, 存储数据也会从每个元素内存地址大的开始存储
     *
     * 2.变量的存储细节
     */
    int num;
    num = 9; // 0000 0000 0000 0000 0000 0000 0000 1001

    int ages[3];
    printf("&ages = %p\n", &ages);
    printf("&ages[0] = %p\n", &ages[0]);
    printf("&ages[1] = %p\n", &ages[1]);
    ages[0] = 1; // 0000 0000 0000 0000 0000 0000 0000 0001
    ages[1] = 3; // 0000 0000 0000 0000 0000 0000 0000 0011
    ages[2] = 5; // 0000 0000 0000 0000 0000 0000 0000 0110
    return 0;
}
