#include <stdio.h>
void printArray(int values[10], int len);
int main()
{
    // 需求: 从键盘输入3个0-9的数字,然后输出0~9中哪些数字没有出现过
    // 输入: 1, 3, 5
    // 输出: 0, 2, 4, 6, 7, 8, 9

    /*
    // 1.提示用户如何输入数据
    printf("请输入3个0~9的整数, 以逗号隔开, 以回车结束\n");
    // 2.定义变量保存用户输入的数据
    int a, b, c;
    // 3.接收用户输入的数据
    scanf("%i,%i,%i", &a, &b, &c);
    // 4.通过循环获得0~9中的所有数
    for(int i = 0; i <10; i++){
        // 5.判断当前拿到的数是否出现过, 如果没有出现过就输出
        if(i == a || i == b || i == c){
            continue;
        }
        printf("i = %i\n", i);
    }
    */

    // 1.提示用户如何输入数据
    printf("请输入3个0~9的整数,以回车结束\n");
    // 2.定义变量保存用户输入的数据
    int value;
    //  0  1  2  3  4  5  6  7  8  9
    // {0, 0, 0, 0, 0, 0, 0, 0, 0, 0}
    int nums[10] = {0};
    // 3.接收用户输入的数据
    // {0, 666, 0, 666, 0, 666, 0, 0, 0, 0}
    for(int i = 0; i < 5; i++){
        scanf("%i", &value);
        // 4.利用用户输入的数据, 作为数组的索引去操作数组
        nums[value] = 666;
    }
    // 5.遍历数组
    for(int i = 0; i < 10; i++){
        // 6.取出当前元素, 判断元素中存储的时候是666
        //  如果存储的是666就不输出, 如果存储的不是666就输出数组对应的索引
        if(nums[i] == 666){
            continue;
        }
        printf("i = %i\n", i);
    }

    return 0;
}

