
#include <stdio.h>

int main()
{
     //字符串的打印 %s , 打印以'\0'标识结尾的字符串
    printf("%s", "Hello,C语言！\n");

    //特殊字符怎么打印.使用\来转义
    printf("  \"  ");
    printf("  \\  "); 
    printf("\n"); 

    //用字符数组保存字符串常量
    char str[] = "Hello";//数组自动推导长度，不要字符串结尾的‘\0’ 字符

    printf("str的长度%d\n", sizeof(str));

    char s[3] = "Hello"; //不会有问题，只是把前3个字符放到字符数组里面
     //相当于是  s[0]='H'   s[1]='e'  s[2]='l'
    //printf("%s ", s); //不能这样打印，因为不是以\0结尾的

    char m[5];
    m[0] = 'H';
    m[1] = 'e';
    m[2] = '\0';//自己加上字符串结束标记'\0'
    printf("%s ", m); //可以打印，因为以\0结尾的 ,如果不打印，无需加\0


}
