#include <stdio.h>

int main()
{
    // 需求: 从键盘输入3个0-9的数字,然后输出0~9中哪些数字没有出现过
    // 输入: 1, 3, 5
    // 输出: 0, 2, 4, 6, 7, 8, 9

    // 1.如果只定义了变量, 没有对变量进行初始化, 那么变量中保存的是垃圾数据
    /*
    int num1;
    printf("num1 = %i\n", num1);
    int num2;
    printf("num2 = %i\n", num2);
    int num3;
    printf("num3 = %i\n", num3);
    int num4;
    printf("num4 = %i\n", num4);
    */

    // 2.如果只定义了数组, 没有对数组进行初始化, 那么数组中的每一个元素保存的都是垃圾数据
    /*
    // 4.如果定义的同时初始化, 那么被初始化的元素会变成初始化的数据, 没有被初始化的元素会变成0
    int nums[10] = {666};
    // 3.如果先定义后初始化, 那么被初始化的元素会变成初始化的数据, 没有被初始化的元素还是垃圾数据
//    nums[0] = 666;
    for(int i = 0; i < 10; i++){
        printf("nums[%i] = %i\n", i, nums[i]);
    }
    */

    return 0;
}
