#include<stdio.h>

void  main()
{
	//表达式，相当于小学的数学题
	int  a = 10 + 20;// 把10+20的结果赋予 整型变量a，这里的=不是相等，而是赋值

	//逗号表达式，只有最后一个表达式的结果作为整个逗号表达式的结果
	int  b = (  1+100,  a=1+5,    a*3    );
	printf("逗号表达式： %d\n" ,b);

	//算术运算符
	printf("+： %d\n",  100+1);
	printf("-： %d\n",   100 -2 );
	printf("*： %d\n",   100 * 2);
	printf("/： %d\n",   100 /2);
	printf("%： %d\n",  100 % 3);//取余数

	//赋值运算符（结合了算术运算符）
	int  c = 2;
	printf("+=： %d\n",  c+=100); //   c= c+100; 
	c = 2;
	printf("-=： %d\n",   c-=100);//   c= c-100;
	c = 2;
	printf("/=： %d\n", c /= 100);//    c=  c/100;
	c = 2;
	printf("*=： %d\n", c *= 100);//    c=  c*100;
	c = 2;
	printf("%%=： %d\n", c %= 100);//取余数


	//真假，0 是假， 除了0之外，全是真
	if (-0.001)//非0真
	{
		printf("-0.001是真\n");
	}
	if (!0)// 0假
	{
		printf("0是假\n");
	}
 
	//关系运算符
	printf("3>2  %d\n" ,   3>2);
	printf("3<2  %d\n",    3<2);
	printf("3==2  %d\n",    3==2);
	printf("3>=2  %d\n",    3 >= 2);
	printf("3<=2  %d\n",    3 <= 2);


	//逻辑运算符
	//且
	printf("假 &&  真  %d\n",  0  &&  1);
	printf("假 &&  假  %d\n", 0 && 0);
	printf("真 &&  真  %d\n", 1 && 1);
	//或
	printf("假  ||  真  %d\n",  0  ||  1 );
	printf("假  ||  假  %d\n",  0 || 0);
	printf("真  ||  真  %d\n",  1 || 1);
	//非
	printf("！假  %d\n",   !0   ); 
	printf("！真  %d\n",   !1   );


	// 位运算符 
    //00000001          十进制1 
	//00000010          十进制2
	int  d = 1;
	int  e = 2;
	printf("  &   %d\n", d&e);// 同为1则1，  00000000 
	printf("   |   %d\n", d|e);//    有1则1       00000011    
	printf("  ^   %d\n", d^e);//   相反则1      00000011   
	printf("  ~   %d\n",  ~d); //   0则1           11111110 
	printf("  <<   %d\n", d<<2);//左移2位     00000100   
	printf("  >>   %d\n", e>> 1);//右移1位     00000001   


	//自增，自减
	int  f = 10;
	printf("  --   %d\n", --f);//自减1
	printf("  --   %d\n", --f);//自减1   
	printf("  ++   %d\n", ++f);//自减1   

	//三目运算符 
	printf( " 三目运算  %d\n",  1?1000 : 2000);
	printf(" 三目运算  %d\n",    0? 1000 : 2000);


}