#include<stdio.h>

void  main()
{
 
	//定义二维数组并初始化
	int  arr[2][3] = { {1,2,3},{4,5,6} };

	//定义二维数组、然后进行赋值
	int  arr2[2][3] ;

	//相当于给第一个元素（是个一维数组）赋值
	arr2[0][0] = 1;  //第一行第一列
	arr2[0][1] = 2;  //第一行第二列
	arr2[0][2] = 3;

	//相当于给第二个元素（是个一维数组）赋值
	arr2[1][0] = 4;//第二行的第一列
	arr2[1][1] = 5;
	arr2[1][2] = 6;

	//二维数组的遍历， 实际上内存空间也是连续的
	 for (int i = 0; i < 2; ++i)
     for (int j = 0; j < 3; ++j)
	 { 
	     //	printf("%d   ", arr2[i][j]);
		 printf("%p   ", &arr2[i][j]);//每个元素的起始地址，二维数组的每个元素也是连续存储的
	 }



}