#include <stdio.h>

int main()
{
    /*
     * 1.什么是多级指针?
     * 在定义指针变量的时候,
     * 如果我们写了一颗星, 我们称之为一级指针,
     * 如果我们写了两颗星, 我们称之为二级指针, 其它以此类推
     *
     * int *p;      一级指针
     * int **pp;    二级指针
     * int ***ppp;  三级指针
     *
     * 2.不同级别指针的区别?
     * 一级指针是专门用于保存普通变量地址的
     * 二级指针是专门用于保存一级指针变量地址的
     * 三级指针是专门用于保存二级指针变量地址的
     */
    // 定义一个普通变量
    int num = 123;
    // 需求: 要求定义一个变量保存普通变量的地址
    int *p;
    p = &num;
    printf("&num = %p\n", &num); // 0060FEA8
    printf("p = %p\n", p); // 0060FEA8
    printf("*p = %i\n", *p); // 123

    // 需求: 要求定义一个变量保存一级指针变量的地址
    int **p2;
    p2 = &p;
    printf("&p = %p\n", &p); // 0060FEA4
    printf("p2 = %p\n", p2); // 0060FEA4
    printf("*p2 = %p\n", *p2); // 0060FEA8
    printf("**p2 = %i\n", **p2); // 123
    return 0;
}
