#include<stdio.h>

void  main()
{
	//常量有哪些
	/*
	 字符常量：    'A'   'a'    'B'                     字母，用单引号括起来
	 整型常量:        1    2000    30000           数字
	 浮点型常量：   1.2345                           小数 
	 字符串常量：     "hello"    "张三"  "$$"   一串字母，用双引号括起来
	*/
	
	//定义变量并初始化 ，1步搞定
	char  a = 'A';  //字符型变量
	int    b = 100;//整型变量
	float c = 1.234;//单精度浮点型变量
	double d = 1.2334555;//双精度浮点型


	//变量赋值，1先定义变量，2再给值
	int  e;//白板
	e = 10;//在白板上写10
	e = 20;//把之前的10擦除，然后在白板上写20

	/*
	   =  不代表数学的相等，而是把内容放到内存中，我们称为赋值
	*/


}