/**
 ******************************************************************************
 * @file      tem.h
 * @author    YeDapeng
 * @version   V1.0.0
 * @date      20220209
 * @brief     处理温度相关的数据 
 ******************************************************************************
 */
#ifndef _TEMP_HUMI_H_
#define _TEMP_HUMI_H_

#include "stdint.h" 

#define TEMP_SENSOR_NUM  3
#define TEMP_DATA_NUM    5

#define CEL_MAX_VALUE  55.0f
#define CEL_MIN_VALUE  5.0f

#define CEL_TO_FAH(t)  ((t) *  9.0f / 5.0f + 32)

typedef struct
{
	uint32_t id;
	float temp;
	uint8_t humi;
} TempHumiSensor;

/**
 ******************************************************************************
 * @brief 设置温度校准系数
 * @param temCof: 输入参数，温度较准系数
 * @return 
 ******************************************************************************
 */
void SetTemCof(float temCof);

/**
 ******************************************************************************
 * @brief 提供摄氏温度数据
 * @param  传感器ID
 * @return 摄氏温度数值
 ******************************************************************************
 */
float GetCelTem(uint8_t sensorId);

/**
 ******************************************************************************
 * @brief 提供华氏温度数据
 * @param  传感器ID
 * @return 华氏温度数值
 ******************************************************************************
 */
float GetFahTem(uint8_t sensorId);

/**
 ******************************************************************************
 * @brief 提供湿度数据
 * @param  传感器ID
 * @return 湿度数值
 ******************************************************************************
 */
uint8_t GetHumiData(uint8_t sensorId);

#endif
