#include <stdio.h>

int main()
{
    /*
     需求:
     ****
     ***
     **
     *

     经验:
     1.在企业开发中, 但凡遇到很多行很多列的需求, 就要想到循环嵌套
     2.在企业开发中, 可以将比较难的需求先转换为相对简单的需求, 实现之后再转发为难的需求

     ****
     ****
     ****
     ****

     规律:
     在企业开发中, 尖尖朝下, 需要修改内循环的初始化表达式等于外循环的变量
     */

//    int count = 0;
    for(int i = 0; i < 4; i++){
//        for(int j = count; j < 4;j ++){
        for(int j = i; j < 4;j ++){
            printf("*");
        }
//        count++;
        printf("\n");
    }
    return 0;
}
