#include <stdio.h>

int main()
{
    /*
     * 1.按位与的运算特点
     * 二进制中的每一位按位与上1, 结果还是那一位
     * 9 & 15
     *
     * 1001
     *&1111
     *------
     * 1001
     *
     * 2.按位异或的运算特点
     * 2.1二进制中一个数按位异或上自己, 结果等于0
     * 2.2二进制中一个数按位异或上0, 结果等于自己
     * 2.3二进制中一个数按位异或上另外一个数两次, 那么结果还是那个数
     *
     * 9 ^ 9
     *
     * 1001
     *^1001
     *------
     * 0000
     *
     * 6 ^ 0
     * 0110
     *^0000
     *------
     * 0110
     *
     *
     * 6 ^ 9 ^ 9  --> 6 ^ 0
     * 0110
     *^1001
     *-------
     * 1111
     *^1001
     *-------
     * 0110
     */

    int pwd = 123456; // 密码
    int res = pwd ^ 8;
    printf("res = %i\n", res);
    int res2 = res ^ 8;
    printf("res2 = %i\n", res2);
    return 0;
}
