#include<stdio.h>

void  main()
{
    //定义字符数组并且初始化化
	char   str[5] = {  'h', 'e','l','l','o'  };//5个元素

   //第二种定义时初始化方式
	char str2[5] = "hello";//字符串，实际上末尾还有一个隐藏的字符  '\0'


	//先定义，再赋值
	char   str3[5];
	str3[0] = 'h';
	str3[1] = 'e';
	str3[2] = 'l';
	str3[3] = 'l';
	str3[4] = 'o';

	//一维数组的遍历
	for (int i = 0; i < 5; ++i)
	{
		printf("%c",  str2[i]);
	}



	printf("\n");

	//先输出字符串， "hello"字符串里面自动包含'\0'
	printf("%s\n", "hello"); //C语言以'\0’为字符串的结束符

	printf("%s\n", str);//输出字符数组，因为我们的字符数组没有'\0'结束符，所以呢，会一直往后寻找，打印出乱码

	//所以呢，如果我们想以%s形式输出，数组最后一个元素必须是'\0'
	char   str4[6] = { 'h', 'e','l','l','o','\0' };//6个元素
	printf("%s\n", str4);
}