#include <stdio.h>

int main()
{
    /*
     * 1.二进制转八进制
     * 规律: 三个二进制位就是一个八进制位
     * 2.二进制转十六进制
     * 规律: 四个二进制位就是一个十六进制位
     */
    /*
     001 101 101
     1   5   5

     111 == 7
     1 * 2(2) + 1 * 2(1) + 1 * 2(0)
     4        + 2        + 1
     7
     因为111代表的数值是7, 而八进制每一位最大的值就是7
     所以三个二进制位代表一个八进制位
     */
//    int num1 = 0b001101101;
//    printf("num1 = %i\n", num1);
//    int num2 = 0155;
//    printf("num2 = %i\n", num2);
    /*
      0110 1101
      6    D

      1111
     1 * 2(3) + 1 * 2(2) + 1 * 2(1) + 1 * 2(0)
     8          4        + 2        + 1
     15
     因为1111代表的数值是15, 而十六进制每一位最大的值就是15
     所以四个二进制位代表一个十六进制位
     */
    int num1 = 0b001101101;
    printf("num1 = %i\n", num1);
    int num2 = 0x6d;
    printf("num2 = %i\n", num2);
    return 0;
}
