#include <stdio.h>

int main()
{
    /*
     * 1.内存是一个线性有序的模型
     * 2.内存地址是从大到小的
     * 3.由于内存地址是从大到小的, 所以开辟存储空间的时候, 也会从大到小的开辟
     * 4.变量的地址就是自己占用内存最小的那个字节地址
     * 5.由于分配存储空间会从地址大的开始分配, 所以存储数据也会从内存地址大的开始存储
     */
    int num;
    int value;
    // %p的作用就是打印地址
    printf("%p\n", &num);
    printf("%p\n", &value);

    // 0000 0000 0000 0000 0000 0000 0000 1001
    num = 9;
    // 0000 0000 0000 0000 0000 0000 0000 0110
    value = 6;

    char *ch = &value;
    for(int i = 0; i < 4; i++){
        printf("%i\n", ch[i]);
    }
    return 0;
}
