#include <stdio.h>

int main()
{
    // 关系运算符得到的结果，
    //真 ( 非0的数就是真 ，一般用1表示 )或 假( 0 )

    printf("1 < 100 的结果是%d\n", 1 < 100);
    printf("1 > 100 的结果是%d\n", 1 > 100);
    printf("1 == 100 的结果是%d\n", 1 == 100);
    printf("1 <= 100 的结果是%d\n", 1 <= 100);
    printf("1 >= 100 的结果是%d\n", 1 >= 100);
    printf("1 != 100 的结果是%d\n", 1 != 100);

    printf("\n\n\n");
    //测试逻辑运算符，与 或 非

    //与   a && b ，ab全部为真的时候，结果才真，否则假
    printf(" 1 &&  1 的结果是 %d \n", 1 && 1);
    printf(" 1 &&  0 的结果是 %d \n", 1 && 0);
    printf(" 0 &&  1 的结果是 %d \n", 0 && 1);
    printf(" 0 &&  0 的结果是 %d \n", 0 && 0);

    printf("\n");

    //或   a ||  b ，a b至少有一个为真的时候，结果才真，否则假
    printf(" 1 ||  1 的结果是 %d \n", 1 || 1);
    printf(" 1 ||  0 的结果是 %d \n", 1 || 0);
    printf(" 0 ||  1 的结果是 %d \n", 0 || 1);
    printf(" 0 ||  0 的结果是 %d \n", 0 || 0);

    printf("\n");

    //非  !a  ,   a是真，结果为假， a是假，结果为真
    printf(" !1 的结果是 %d \n",   !1 );
    printf(" !0 的结果是 %d \n",   !0);

}
