#include <stdio.h>

int main()
{
    // 需求: 要求从键盘输入5个0~9的数字,排序后输出
    // 输入: 3, 5, 3, 8, 2
    // 输出: 1, 2, 3, 5, 8

    //  0  1  2  3  4  5  6  7  8  9
    // {0, 0, 1, 2, 0, 1, 0, 0, 1, 0}

    // 1.提示用户输入数据
    printf("请输入5个整数, 以回车结束\n");
    // 2.定义变量保存用户输入的数据
    int value;
    int nums[10] = {0};
    // 3.接收用户输入的数据
    for(int i = 0; i < 5; i++){
        scanf("%i", &value);
        // 4.将用户输入的数据, 作为数组的索引去操作数据
        nums[value] = 1 + nums[value]; // 1 + 1
    }
    // 5.遍历数组, 取出所有元素
    for(int i = 0 ; i < 10; i++){
        // 6.判断当前元素有没有存储数据, 如果存储了数据, 输出索引
//        if(nums[i] == 1){
//            printf("i = %i\n", i);
//        }
        for(int j = 0; j < nums[i]; j++){
            printf("i = %i\n", i);
        }
    }
    return 0;
}
